"""Напишите программу ввода двух строк (каждая вводится с новой строки) и их объединения в одну строку через пробел. Результат выведите на экран"""

s1, s2 = input(), input()

res = s1 +' '+s2

print(res)
