"""Напишите программу, которая принимает на вход два вещественных числа в одну строку через пробел и выводит на экран их сумму."""

n1, n2 = map(float, input().split())

print(n1 + n2)