"""Напишите программу, в которой вводятся два целых положительных числа и в консоль выводится результат возведения первого числа в степень второго."""

n1, n2 = map(int, input().split())

print(n1**n2)
